Repository: 0-Luminous/NicotineDone
Catalog: NicotineDone/Localization/*.lproj/Localizable.strings
Languages: ru

source: Vape
ru: Вейп

source: Cigarettes
ru: Сигареты

source: + Puff
ru: + Затяжка

source: + Cigarette
ru: + Сигарета

source: Time since last use
ru: Время с последнего употребления

source: Best nicotine-free streak
ru: Рекорд без никотина

source: Start logging to enable the timer.
ru: Начни вести учёт, чтобы запустить таймер.

source: No record yet
ru: Рекорд пока отсутствует

source: <1m
ru: <1 мин

source: %1$@ LEFT TODAY: %2$d/%3$d
ru: ОСТАЛОСЬ %1$@: %2$d/%3$d

source: Next at: anytime
ru: Следующая запись: в любое время

source: Next at: now
ru: Следующая запись: сейчас

source: Next at: %@
ru: Следующая запись: %@

source: CIGARETTES
ru: СИГАРЕТ

source: PUFFS
ru: ЗАТЯЖЕК

source: Welcome to PuffQuest
ru: Добро пожаловать в PuffQuest

source: Choose your track
ru: Выбери свой формат

source: Set a daily limit
ru: Установи дневной лимит

source: Create your profile
ru: Создай профиль

source: Track, reduce, and celebrate every win on your smoke-free quest.
ru: Отслеживай, сокращай и радуйся каждому шагу к свободе.

source: Stay within your limits to earn XP, coins, and unlock new themes.
ru: Держись в пределах лимита, чтобы получать опыт, монеты и открывать темы.

source: Keep the number realistic to stay motivated.
ru: Выбери реальное число, чтобы сохранять мотивацию.

source: Use Sign in with Apple (optional)
ru: Войти с Apple ID (опционально)

source: Local profile is always available. Link Apple ID later in settings.
ru: Локальный профиль доступен всегда. Привязать Apple ID можно позже в настройках.

source: Back
ru: Назад

source: Next
ru: Далее

source: Start
ru: Начать

source: Hello, %@
ru: Привет, %@

source: Calendar
ru: Календарь

source: Stats
ru: Статистика

source: Achievements
ru: Достижения

source: Streak
ru: Серия

source: Current: %d days
ru: Текущая: %d дн.

source: Best: %d days
ru: Лучшая: %d дн.

source: Nice pace! Stay under your limit to earn bonus XP tonight.
ru: Отличный темп! Держись лимита и получишь бонус XP вечером.

source: Close to the limit. A mindful pause keeps the streak burning.
ru: Почти у лимита. Небольшая пауза сохранит серию.

source: Limit exceeded. Tomorrow is a fresh start!
ru: Лимит превышен. Завтра новый шанс!

source: Every calm breath earns you XP.
ru: Каждый спокойный вдох приносит XP.

source: Keep the streak alive!
ru: Держи серию!

source: Less today means more freedom tomorrow.
ru: Меньше сегодня — больше свободы завтра.

source: Day details
ru: Детали дня

source: Close
ru: Закрыть

source: Average per day
ru: Среднее в день

source: Daily limit
ru: Дневной лимит

source: Estimated savings / month
ru: Экономия за месяц (оценка)

source: Level
ru: Уровень

source: Coins
ru: Монеты

source: Streaks
ru: Серии

source: App mode
ru: Режим приложения

source: Application theme
ru: Тема приложения

source: Select the method of use
ru: Выберите метод употребления

source: Pick the nicotine method you want to track.
ru: Выберите способ употребления никотина, который вы хотите отслеживать.

source: This keeps reminders, stats, and budgeting focused on the right product.
ru: Это помогает держать напоминания, статистику и бюджетирование сосредоточенными на нужном продукте.

# stats_chart_weekly_trend
source: Weekly trend
ru: Недельная динамика

# stats_chart_axis_day
source: Day
ru: День

# stats_chart_axis_count
source: Count
ru: Количество

# stats_chart_more_data_needed
source: More data is needed to show stats.
ru: Для статистики требуется больше данных

# stats_financial_title
source: Financial overview
ru: Финансовый обзор

# stats_financial_subtitle
source: Based on last 30 days
ru: За последние 30 дней

# stats_financial_limit_label
source: Monthly limit
ru: Месячный лимит

# stats_financial_spent_title
source: Spent this month
ru: Потрачено за месяц

# stats_financial_saved_title
source: Saved this month
ru: Сэкономлено за месяц

# stats_financial_set_limit_hint
source: Set your limit to compare
ru: Укажи лимит для сравнения

# stats_financial_spent_percent
source: %d%% of monthly limit
ru: %d%% от лимита

# stats_financial_savings_positive
source: Kept below your limit
ru: Держишься ниже лимита

# stats_financial_savings_negative
source: Track consistently to unlock savings
ru: Отмечай стабильно, чтобы увидеть экономию

# stats_metrics_title
source: Daily insights
ru: Ежедневная аналитика

# stats_metrics_average_title
source: Average / day
ru: Среднее / день

# stats_metrics_average_caption
source: Last 7 days
ru: Последние 7 дней

# stats_metrics_goal_caption
source: Goal per day
ru: Цель в день

# stats_metrics_level_caption
source: Progress tier
ru: Уровень прогресса

# stats_metrics_xp_caption
source: Lifetime experience
ru: Опыт за всё время

# stats_metrics_coins_caption
source: Spend on rewards
ru: Трать на награды

# stats_streak_current_label
source: Current
ru: Текущая

# stats_streak_best_label
source: Best
ru: Лучшая

source: Profile
ru: Профиль

source: Display name
ru: Имя

source: Tracking
ru: Учёт

source: Product type
ru: Тип продукта

source: Daily limit: %d
ru: Лимит в день: %d

source: Appearance
ru: Оформление

source: Accent color
ru: Акцентный цвет

source: Reset onboarding
ru: Сбросить онбординг

source: You can re-run the onboarding to change more details or start a new journey.
ru: Повтори онбординг, чтобы изменить детали или начать новый путь.

source: Settings
ru: Настройки

source: Adventurer
ru: Искатель

source: Save
ru: Сохранить

# onboarding_welcome_title
source: Welcome to %@
ru: Добро пожаловать в %@

# onboarding_welcome_subtitle
source: Track nicotine, spending, and progress in one place.
ru: Отслеживай никотин, расходы и прогресс в одном месте.

# onboarding_primary_cta
source: Get started
ru: Поехали

# onboarding_primary_cta_hint
source: Opens nicotine method selection
ru: Откроет выбор темы

# onboarding_mode_coming_soon
source: Coming soon
ru: Скоро

# onboarding_mode_picker_title
source: Choose your mode
ru: Выберите режим

# onboarding_mode_picker_subtitle
source: Swipe to match how you plan to use the app.
ru: Свайпайте влево или вправо, чтобы выбрать комфортный сценарий.

# onboarding_mode_swipe_hint
source: Swipe left or right to explore each mode.
ru: Свайпайте, чтобы посмотреть все режимы.

# onboarding_mode_tracking_title
source: Tracking
ru: Отслеживание

# onboarding_mode_tracking_description
source: Log every cigarette or puff and keep a clear picture of spending.
ru: Записывайте каждую сигарету или затяжку и контролируйте траты.

# onboarding_mode_gradual_title
source: Gradual reduction
ru: Постепенное уменьшение

# onboarding_mode_gradual_description
source: Set gentle limits, watch trends, and slowly bring the daily count down.
ru: Ставьте мягкие лимиты и постепенно снижайте дневное количество.

# onboarding_mode_quit_title
source: Quit right now
ru: Бросаю прямо сейчас

# onboarding_mode_quit_description
source: Go all in with zero tolerance and stay focused on becoming nicotine-free.
ru: Максимальная поддержка, напоминания и мотивация для нулевого никотина.

# onboarding_method_title
source: Choose your method
ru: Выбери способ

# onboarding_method_card_hint
source: Opens detailed setup
ru: Открывает форму параметров

# onboarding_method_cigarettes
source: Cigarettes
ru: Сигареты

# onboarding_method_disposable_vape
source: Disposable vape
ru: Одноразовый вейп

# onboarding_method_refillable_vape
source: Refillable vape
ru: Заправляемый вейп

# onboarding_method_heated_tobacco
source: Heated tobacco
ru: Нагреваемый табак

# onboarding_method_snus_or_pouches
source: Snus or pouches
ru: Снюс / пакетики

# onboarding_section_currency
source: Currency
ru: Валюта

# onboarding_currency_picker_title
source: Preferred currency
ru: Предпочитаемая валюта

# onboarding_section_consumption
source: Consumption
ru: Потребление

# onboarding_section_cost
source: Cost
ru: Стоимость

# onboarding_validation_section
source: Validation
ru: Проверка

# onboarding_warning_section
source: Warnings
ru: Предупреждения

# onboarding_helper_section
source: Tips
ru: Подсказки

# onboarding_continue
source: Continue
ru: Продолжить

# onboarding_welcome_hint
source: Swipe or tap later to finish setup anytime in settings.
ru: Можно пропустить сейчас и закончить настройку позже в настройках.

# onboarding_step_one
source: Step 1
ru: Шаг 1

# onboarding_method_card_hint_copy
source: Choose what you want to keep an eye on first.
ru: Определи, что хочешь отслеживать в первую очередь.

# onboarding_currency_search_placeholder
source: Search currency
ru: Поиск валюты

# back_button
source: Back
ru: Назад

# cigarettes_per_day_title
source: How many cigarettes per day?
ru: Сколько сигарет в день?

# cigarettes_per_day_subtitle
source: Tell us the average day to set your baseline.
ru: Укажи среднее значение для расчёта базы.

# cigarettes_per_day_range
source: Allowed range: 1-99.
ru: Допустимо: 1-99.

# cigarettes_per_pack_title
source: Cigarettes per pack
ru: Сигарет в пачке

# cigarettes_per_pack_subtitle
source: Most packs include 20 sticks.
ru: Чаще всего 20 штук.

# cigarettes_per_pack_range
source: Allowed range: 10-40.
ru: Допустимо: 10-40.

# pack_price_title
source: Pack price
ru: Цена пачки

# pack_price_placeholder
source: Ex: 7.50
ru: Напр.: 7.50

# pack_price_tip
source: Use your usual store price to calculate per-cigarette costs.
ru: Возьми привычную цену, чтобы посчитать стоимость сигареты.

# puffs_per_device_title
source: Puffs per device
ru: Затяжек в устройстве

# puffs_per_device_subtitle
source: Check the number printed on the box.
ru: Посмотри цифру на коробке.

# puffs_per_device_range
source: Allowed range: 600-10000.
ru: Допустимо: 600-10000.

# device_price_title
source: Device price
ru: Цена устройства

# device_price_placeholder
source: Ex: 12.99
ru: Напр.: 12.99

# device_price_tip
source: Helps estimate the cost per 100 puffs.
ru: Нужно, чтобы оценить стоимость 100 затяжек.

# liquid_volume_title
source: Bottle volume (ml)
ru: Объём флакона (мл)

# liquid_volume_subtitle
source: Total milliliters in the bottle.
ru: Общее количество жидкости.

# liquid_volume_range
source: Allowed range: 10-120.
ru: Допустимо: 10-120.

# nicotine_strength_title
source: Nicotine strength (mg/ml)
ru: Крепость (мг/мл)

# nicotine_strength_subtitle
source: Printed on the label.
ru: Как указано на этикетке.

# nicotine_strength_range
source: Allowed range: 1-60.
ru: Допустимо: 1-60.

# puffs_per_ml_title
source: Estimated puffs per ml
ru: Затяжек на 1 мл

# puffs_per_ml_subtitle
source: Use your own estimate or the device guide.
ru: Используй свой опыт или подсказку устройства.

# puffs_per_ml_range
source: Allowed range: 10-30.
ru: Допустимо: 10-30.

# liquid_price_title
source: Bottle price
ru: Цена флакона

# liquid_price_placeholder
source: Ex: 15.00
ru: Напр.: 15.00

# coil_price_toggle
source: Add coil price
ru: Добавить цену койла

# coil_price_title
source: Coil price
ru: Цена койла

# coil_price_placeholder
source: Ex: 5.00
ru: Напр.: 5.00

# refillable_price_tip
source: We combine liquid and coil cost to estimate daily spending.
ru: Суммируем жидкость и койл, чтобы посчитать дневные траты.

# heated_daily_sticks_title
source: Daily sticks
ru: Стики в день

# heated_daily_sticks_subtitle
source: Average sticks consumed per day.
ru: Среднее количество за день.

# heated_daily_sticks_range
source: Keep it above zero for better stats.
ru: Значение должно быть больше нуля.

# heated_sticks_per_pack_title
source: Sticks per pack
ru: Стиков в пачке

# heated_sticks_per_pack_subtitle
source: Most packs include 20 sticks.
ru: Обычно 20 штук.

# heated_sticks_per_pack_range
source: Enter the exact number in your pack.
ru: Укажи точное число из пачки.

# heated_pack_price_title
source: Pack price
ru: Цена пачки

# heated_pack_price_placeholder
source: Ex: 7.00
ru: Напр.: 7.00

# snus_daily_title
source: Daily pouches
ru: Пакетиков в день

# snus_daily_subtitle
source: Average number consumed per day.
ru: Среднее значение.

# snus_daily_range
source: Use a realistic positive number.
ru: Используй реальное положительное число.

# snus_per_can_title
source: Pouches per can
ru: Пакетиков в банке

# snus_per_can_subtitle
source: Printed on the can.
ru: Указано на банке.

# snus_per_can_range
source: Enter the total pouches in one can.
ru: Сколько пакетиков в одной банке.

# snus_can_price_title
source: Can price
ru: Цена банки

# snus_can_price_placeholder
source: Ex: 6.50
ru: Напр.: 6.50

# hint_price_per_cigarette
source: Approximate price per cigarette: %@
ru: ≈ цена за сигарету: %@

# hint_price_per_100_puffs
source: Cost per 100 puffs: %@
ru: Стоимость 100 затяжек: %@

# hint_refillable_price_per_100
source: Liquid cost per 100 puffs: %@
ru: Жидкость за 100 затяжек: %@

# hint_refillable_daily_cost
source: Estimated daily cost (%d puffs): %@
ru: Дневная стоимость (%d затяжек): %@

# hint_heated_price_per_stick
source: Approximate price per stick: %@
ru: ≈ цена за стик: %@

# hint_snus_price_per_pouch
source: Approximate price per pouch: %@
ru: ≈ цена за пакетик: %@

# validation_cigarettes_per_day
source: Daily cigarettes must be between 1 and 99.
ru: Сигарет в день должно быть от 1 до 99.

# validation_cigarettes_per_pack
source: Pack size must be between 10 and 40.
ru: В пачке может быть только 10-40 сигарет.

# validation_pack_price_positive
source: Pack price must be greater than 0.
ru: Цена пачки должна быть больше нуля.

# warning_cigarettes_high_consumption
source: Your daily amount is more than twice the pack size. Make sure this is intentional.
ru: Количество в день больше двух пачек. Убедись, что всё верно.

# validation_puffs_range
source: Enter 600-10000 puffs per device.
ru: Укажи 600-10000 затяжек в устройстве.

# validation_device_price_positive
source: Device price must be greater than 0.
ru: Цена устройства должна быть больше нуля.

# validation_liquid_volume
source: Bottle volume must be between 10 and 120 ml.
ru: Объём флакона должен быть от 10 до 120 мл.

# validation_liquid_price_positive
source: Bottle price must be greater than 0.
ru: Цена флакона должна быть больше нуля.

# validation_nicotine_strength
source: Nicotine strength must be between 1 and 60 mg/ml.
ru: Крепость должна быть от 1 до 60 мг/мл.

# validation_coil_price_positive
source: Coil price cannot be negative.
ru: Цена койла не может быть отрицательной.

# validation_estimated_puffs
source: Estimated puffs per ml must be between 10 and 30.
ru: Оценка затяжек на 1 мл должна быть 10-30.

# validation_sticks_per_pack
source: Enter how many sticks are in one pack.
ru: Укажи, сколько стиков в пачке.

# validation_daily_sticks_positive
source: Daily sticks must be greater than 0.
ru: Стики в день должны быть больше нуля.

# validation_pouches_per_can
source: Enter how many pouches are in one can.
ru: Укажи, сколько пакетиков в банке.

# validation_can_price_positive
source: Can price must be greater than 0.
ru: Цена банки должна быть больше нуля.

# validation_daily_pouches_positive
source: Daily pouches must be greater than 0.
ru: Пакетики в день должны быть больше нуля.

# error_no_method_selected
source: Select a nicotine method to continue.
ru: Выбери способ употребления, чтобы продолжить.

# error_invalid_form
source: Please fix the highlighted fields before continuing.
ru: Исправь отмеченные поля, чтобы продолжить.

# onboarding_method_cigarettes_desc
source: Daily cigarettes, pack price, per-stick insights.
ru: Сигареты в день, цена пачки и стоимость затяжки.

# onboarding_method_disposable_vape_desc
source: Track puff count and device cost.
ru: Следи за количеством затяжек и ценой устройства.

# onboarding_method_refillable_vape_desc
source: Log liquid volume, nicotine strength, coils.
ru: Фиксируй объём, крепость и стоимость жидкостей/койлов.

# onboarding_method_heated_tobacco_desc
source: Monitor stick packs and daily habits.
ru: Отмечай пачки стиков и ежедневное потребление.

# onboarding_method_snus_or_pouches_desc
source: Keep cans, price, and pouch usage in sync.
ru: Контролируй банки, стоимость и пакетики в день.
